{
    "paper" : [
        "The Developmental State. Meredith Woo-Cumings",
        "MITI and the Japanese Miracle",
        "The developmental state: dead or alive?",
        "Developmental States Stephan Haggard",
        "Developmental state or economic statecraft? Where, why and how the difference matters",
        "Developmental states and threat perceptions in Northeast Asia",
        "Development state evolving: Japan's graduation from a middle income country",
        "Developmental state: A theoretical and methodological critique",
        "Engineering China: the origins of the Chinese developmental state",
        "The developmental state in the era of globalization: beyond the Northeast Asian model of political economy",
        "The developmental state is dead: long live the developmental state",
        "The Origins of the Developmental State in Taiwan: Science Policy and the Quest for Modernization",
        "Systemic vulnerability and the origins of developmental states: Northeast and Southeast Asia in comparative perspective",
        "Bureaucratic Rationality and the Developmental State",
        "Reviving the Developmental State? The Myth of the 'National Bourgeoisie'",
        "The successful developmental state: where does it come from?",
        "Building the Developmental State:Achieving Economic Growth Through Co-operative Solutions: A Comment on Bringing Politics Back In",
        "Working Paper No . 4 In Search of The 21 st Century Developmental State",
        "Is India a Developmental State",
        "The successful developmental state: where does it come from",
        "Developmental states and socialist industrialisation in the Third World",
        "Thinking about Developmental States in Africa",
        "Developmental States in Africa? A Review of Ongoing Debates and Buzzwords",
        "Revisiting the Developmental State",
        "Developmental States: A Review of the Literature",
        "US grand strategy and the origins of the developmental state",
        "Politics of Development Scalapino, Robert",
        "The Chinese 'developmental state 3.0' and the resilience of authoritarianism",
        "China as a developmental state"
    ]
}