{"Trump again vows to deport millions of migrants. Could he really do it? - ABC News": ["Trump will seal the border on Day 1 of his new administration.", "79% of the population have been in the country since before 2010.", "Families are being separated.", "The last mass deportation of migrants in the U.S. occurred in the 1950s.", "The mass deportation was under President Dwight D. Eisenhower.", "Thousands of enforcement personnel are needed."], "Businesses push Biden to grant work permits to longtime undocumented immigrants | CNN Politics": ["Winton co-founded Winton Machine Company in Suwanee, Georgia.", "Winton depends on immigrant workers.", "Winton needs more legal people for jobs.", "Winton is looking for more legal people to come to him for jobs.", "The American Business Immigration Coalition is spearheading a drive.", "Trump plans to deport millions of people.", "The deportation will take place in the US.", "The Biden administration is discussing providing work permits.", "The work permits would be for undocumented spouses.", "The undocumented spouses would be of American citizens and legal residents.", "7.8 million unauthorized immigrants were in the labor force in 2021.", "40% of hired farm crop workers are not legally authorized to work.", "One in five undocumented workers are employed in a construction-related sector.", "More than 2 million people have work authorization.", "These work authorizations were obtained through USCIS programs.", "Expanding work authorization will increase wages for current employees.", "The expansion will apply to longtime immigrants.", "Nearly 80% of the 11 million unauthorized immigrants entered before 2010.", "Trump undertook more than 400 executive actions on immigration.", "Trump's administration quadrupled the number of ICE arrests.", "The Trump administration removed immigrants from the nation's interior.", "The number of immigrants removed was modest.", "The administration increased the number of arrests made by ICE.", "Officials would likely be able to quickly ramp up deportations.", "Undocumented workers contribute to the economy.", "Sending workers back to Mexico will cripple the dairy industry in the country."], "Trump’s Tough Immigration Talk Comes With a High Price Tag": ["The Republican party attaches itself to Trump.", "Trump plans to end birthright citizenship.", "The former president had a plan to deport unauthorized immigrants.", "There are more than 14 million unauthorized immigrants in the U.S. today.", "A higher deportation target means rapidly accumulating costs for the U.S. government.", "The Center for American Progress calculated the cost of a mass deportation strategy in 2015.", "CIS used a slightly higher per-migrant cost for its estimate.", "The cost was $16,000 per migrant in 1990.", "The predicted spending is for arresting undocumented immigrants.", "CIS offsets the price of deporting millions.", "CIS compares the cost of deportation to a \"total lifetime fiscal cost\" of $1.6 trillion to the U.S.", "More deportations lead to less economic growth.", "Mass deportations were looming.", "Deportations will have to occur if Rubio's estimate is correct.", "Americans consistently name immigration as a leading concern."], "Trump’s Plans for Mass Deportation Would Be an Economic Disaster | Washington Monthly": ["Donald Trump has a fierce enmity towards immigrants.", "79 percent of immigrants have lived in the US for at least 12 years.", "44 percent of immigrants have lived in the US for 20 to 40 years.", "Only 4 percent of unauthorized immigrants work in agriculture.", "Mass deportation would be damaging to the construction industry.", "The construction industry employs more than 7 percent of unauthorized immigrants.", "A recent study found clear evidence that deportations cost other American jobs.", "Deporting 1 million immigrants would lead to 88,000 additional employment losses by other Americans.", "Okun's law can be applied to mass deportations.", "According to Okun's law, if the rate of unemployment increases by 1%, the rate of mass deportation will decrease by 2%.", "16.6 percent of employed unauthorized immigrants work part-time.", "83.7 percent of employed unauthorized immigrants work full-time.", "A mass deportation program could depress national wage and salary income by $317.2 billion.", "A study found that apprehending unauthorized immigrants costs the government an average of $18,214 per deportee.", "A study found that detaining unauthorized immigrants costs the government an average of $18,214 per deportee.", "A study found that transporting unauthorized immigrants costs the government an average of $18,214 per deportee.", "A study found that processing unauthorized immigrants costs the government an average of $18,214 per deportee.", "A study found that deporting unauthorized immigrants costs the government an average of $18,214 per deportee.", "A study found that apprehending unauthorized immigrants costs the government an average of $24,094 per apprehension.", "George W. Bush's administration deported about 125,100 people per year.", "The total number of deportations under George W. Bush's administration was 1 million.", "The average number of deportations under Trump was 81,400 people annually.", "The total number of deportations under Trump was 325,000."], "Trump’s Misleading Chart on Illegal Immigration - FactCheck.org": ["The chart showed apprehensions of people trying to enter the U.S. illegally at the southwest border.", "Apprehensions at the southwest border increased by 14.7%.", "A total of 458 miles of \"border wall system\" was built during the Trump administration.", "373 miles of the border wall system was replacement for primary or secondary fencing.", "The Migration Policy Institute director is speaking.", "The Migration Policy Institute director is also referring to the chart.", "The pandemic was responsible for a near-complete halt to global mobility.", "The halt to global mobility occurred in 2020.", "Apprehensions of immigrants attempting to cross illegally reached a pandemic low in April 2020.", "The number of apprehensions reached a record low by the end of Trump's presidency.", "The speaker won on the border.", "There were more than 69,000 apprehensions in October 2020.", "There were more than 69,000 apprehensions in November 2020.", "There were more than 69,000 apprehensions in December 2020.", "There were more than 69,000 apprehensions in January 2021.", "The highest number of apprehensions under Trump occurred during his last four months in office.", "Illegal border crossings were measured by apprehensions at the southwest border.", "The number of apprehensions was 11,127 in January 2019.", "The number of apprehensions was 144,116 in October 2019.", "The year ended with the highest number of apprehensions since Fiscal Year 2007.", "Illegal immigration increased after Biden took office.", "Biden was more welcoming of migrants."], "How Trump’s first term may have laid the groundwork to make his radical immigration agenda a reality | CNN Politics": ["The pledge was to ban entry into the US.", "The ban would apply to certain Muslim-majority nations.", "The implementation and application of the travel ban is a critical step.", "The pathway is necessary for the implementation and application of the travel ban.", "The anti-immigrant rhetoric has darkened during Trump's presidency.", "The effort to build a border wall is ongoing.", "The border wall is being built.", "Stephen Miller is expected to run point on immigration.", "Miller is a person.", "Miller worked on immigration issues for Trump.", "The person with the encyclopedic knowledge is able to apply the law.", "The deportation operation will begin on Day One.", "The operation will be the largest domestic deportation in US history.", "Title 42 was used to implement a de facto ban on asylum seekers.", "The ban was implemented at the US-Mexico border.", "Biden rescinded the former president's travel ban on his first day in office.", "There is a series of interlocking migrant crises.", "The Senate proposal on immigration was bipartisan.", "The proposal captured a dramatic shift on immigration.", "The share of Americans believe immigration is the most important problem facing the country.", "76% of registered voters viewed immigration as extremely or very important to their presidential vote.", "Schulte said Trump's immigration agenda would have a dramatic scale.", "Trump's immigration agenda would have a sweeping effect.", "Mass deportations would require the country to grapple with the reality of the US-Mexico border."], "Amid a bitter, ugly immigration debate, a moment of grace and common sense • Wisconsin Examiner": ["Farmers and immigrant workers have a lot in common.", "The border security bill was doomed.", "The border security bill was crafted after months of negotiations.", "The bill adds 5,000 new asylum officers.", "The bill beefs up Border Patrol.", "Border security is a major issue in the 2024 election.", "Republicans have no intention of voting for the border security compromise.", "The U.S. offers seasonal visas for agricultural work.", "The U.S. does not offer seasonal visas for year-round work.", "The UW Eau Claire Alumni Association awards committee wrote about John.", "The organization takes dairy farmers to Mexico once a year.", "Severo came to the farm 25 years ago.", "Severo's sons were Juan, Federico, and Germán.", "Juan, Federico, and Germán were responsible for the development of the first successful oil refinery in Mexico.", "Rosemary Joyce has worked with Mexicans.", "Ruth Conniff worked for many years in Madison and Washington, DC.", "The DEIJ Policy is a policy."], "Trump's return could shake up H-1B visa system | TechTarget": ["The action will be to curb immigration.", "The Biden administration has created a more favorable climate for visa-sponsored travel.", "The climate is for travel to the US.", "Trump has made efforts to frustrate the H-1B system.", "The denial rate for initial H-1B visas reached a high of 24% in 2018.", "The American Immigration Council reported the denial rate.", "The increased H-1B denial rate in 2018 was due to increased scrutiny.", "The increased H-1B denial rate in 2018 was due to stricter policies.", "The H-1B and L-1 visas are included in the employment-based visa programs.", "The H-1B program should be transformed according to Project 2025's recommendations.", "The government determines eligibility for visas.", "Premium processing for H-1B visas was suspended in 2017.", "The problem may prevent someone from obtaining a visa.", "Oracle plans to acquire Ceridian."], "Where Biden and Trump differ - and overlap - on immigration policy": ["More than two-thirds of Americans disapprove of Mr. Biden's handling of the border.", "Under current law, any foreign national can claim asylum upon arriving to the US.", "Mr Biden campaigned against Mr Trump's restrictive asylum policies.", "Mr Trump had restrictive asylum policies.", "Asylum seekers would have been sent to Mexico once the cap was reached.", "The government allows migrants into the US.", "Migrants do not need a visa to enter the US.", "The humanitarian parole program allows for the release of detained migrants.", "As many as 30,000 migrants are able to fly to the US legally every month.", "The border bill was scrapped.", "The scrapped border bill would have kept certain programs in place.", "The scrapped border bill would have allowed parole for those in humanitarian need.", "The scrapped border bill would have restricted the use of these programs.", "The Biden administration ended the arrest and deportation of migrants in the US interior.", "The number of deportations has fallen to a record low in 2021.", "The executive actions would fast-track deportations.", "The fast-tracked deportations would apply to some immigrants.", "Building a border wall was a signature policy of Donald Trump.", "The barriers will be built in a sparsely populated stretch of the Rio Grande Valley.", "The separation was part of the Trump administration's \"zero-tolerance\" policy.", "The children were held in overcrowded border facilities.", "The family members will be given work permits."], "Trump escalates his immigration rhetoric with baseless claim about Biden | AP News": ["Biden visited the U.S.-Mexico border in January 2021.", "Immigrants are less likely to have been arrested for violent crimes than native-born U.S. residents."], "Bad News For Employers, Immigrants And H-1B Visas In Second Trump Term": ["The restrictions will be on employing foreign-born scientists and engineers.", "Companies rely on foreign-born scientists and engineers to grow and innovate.", "Trump's immigration policies increased the denial rate for H-1B petitions for initial employment to 24% in FY 2018.", "Trump's immigration policies increased the denial rate for H-1B petitions for initial employment to 21% in FY 2019.", "H-1B petitions for continuing employment rose to 12% in FY 2018.", "H-1B petitions for continuing employment rose to 12% in FY 2019.", "The legal settlement resulted in a 12% increase in H-1B petitions for continuing employment in 2018.", "The legal settlement resulted in a 12% increase in H-1B petitions for continuing employment in 2019.", "Trump officials directed USCIS adjudicators.", "The direction was specifically for denying H-1B petitions.", "The direction was given to USCIS adjudicators in a new administration.", "Trump's team published an H-1B interim rule in 2020.", "The rules were meant to limit H-1B visas for high-skilled workers.", "The rules were meant to increase the number of temporary workers allowed to work in the US.", "The Trump and Biden H-1B rules were implemented.", "The companies employ H-1B visa holders.", "The H-1B visa holders are not paid enough.", "The rule was designed to price most H-1B visa holders out of the U.S. labor market.", "Research shows that H-1B restrictions lead to companies sending more jobs, resources, and innovations outside the United States.", "The proclamation suspended the entry of immigrants.", "Employment-based immigrants can adjust their status inside the United States.", "The Supreme Court ruled in Trump v. Hawaii.", "The President's power was to restrict immigration from certain countries."], "Trump or Biden? Either way, US seems poised to preserve heavy tariffs on imports - ABC News": ["Import taxes were imposed a year ago.", "The import taxes were the cause of the increase in consumer prices.", "Factories were moved to low- and middle-income countries.", "Plymouth, Michigan is a location.", "China is trying to export its way out of trouble.", "China's products are cheap."], "Trump has promised an immigration crackdown if reelected. That could backfire on the economy | CNN Business": ["The problem is that the supply of native-born workers cannot keep up with the demand.", "Trump has immigration plans.", "There has been a spike in immigration over the last several years.", "The spike in immigration has caused a severe strain on resources in some cities and states.", "The Biden administration has tried to take a tougher position on immigration.", "Economists say the immigration spike has played a major role in the growth of the country's economy.", "The immigration spike has contributed to the growth of the country's economy.", "The country's economy has experienced growth due to the immigration spike.", "The recent spike in immigration helped ease the tight labor market.", "The recent spike in immigration allowed the economy to grow.", "The federal government made population and labor force projections.", "Immigration levels were lower during the pandemic.", "Immigration levels are returning to pre-pandemic levels.", "Immigration plays a big part in balancing the labor market.", "The US economy could have faced a different outcome without an influx of workers.", "Immigration collapsed when the Covid-19 pandemic began in early 2020.", "In 2023, the United States experienced net immigration of about 3.3 million.", "The average net immigration in the United States is just over 1.5 million people per year.", "The United States is experiencing a significant immigration spike.", "Goldman Sachs economists estimated that there was an immigration surge in 2018.", "The immigration surge eased wage growth by 0.1% in 2018.", "The immigration turnaround was not a major factor in wage changes.", "The immigration turnaround was not a major factor in inflation changes."], "Biden, Trump share differing immigration approaches in Texas | The Texas Tribune": ["The proposed changes would provide quicker answers to migrants.", "Migrants have moved to cities.", "The Marshall Project reported on the correlation between migrant movement and crime rates.", "Brownsville has experienced high numbers of migrants crossing into the country.", "Large migrant encampments have been a frequent sight on the other side of the border.", "The \"remain in Mexico\" program was implemented.", "The program forced some migrants to wait in Mexico.", "The migrants had pending asylum cases.", "The migrants' cases were adjudicated.", "The Biden administration created and expanded programs to help immigrants enter the country legally.", "The Biden administration began requiring asylum-seekers to use the CBP One cellphone application in early 2023.", "There are 1,400 daily appointments available at the US-Mexico border."], "Trump says he’d use police, National Guard and possibly the military to expel immigrants • Louisiana Illuminator": ["Donald Trump planned to carry out mass deportations.", "The deportations would target undocumented immigrants.", "Floyd was a Black man.", "The purpose of these centers would be to carry out mass deportations.", "In the first four years of the Obama administration, there were 1.5 million non-immigrant visas issued.", "The number of non-immigrant visas issued during the first four years of the Obama administration was more than 1.5 million.", "The Trump administration expelled more than 2 million migrants.", "The migrants were expelled from the US-Mexico border.", "In the first four years of the Obama administration, more than 1.5 million non-citizens were deported.", "The first Trump administration's immigration policies led to a 40% increase in border arrests.", "The DEIJ Policy is a policy."], "Minnesota protest sends a message to Trump during St. Paul campaign stop — Fight Back! News": ["The changes were made to dismantle and reconstruct the U.S. immigration system.", "The changes increased barriers to legal immigration.", "The travel ban blocked refugees and travelers with passports.", "The travel ban affected seven Muslim-majority countries.", "MNAAC was formed in direct response to a Supreme Court case.", "The collaborative action was coordinated by members of the Minnesota Immigrant Rights Action Committee (MIRAC)."], "\n    Trump eyes radical immigration shift if elected in 2024, promising mass deportations and ideological screenings - CBS News": ["The children of immigrants living in the country unlawfully would no longer receive birthright citizenship.", "Trump's immigration pledges were made by him.", "Trump promised to carry out a deportation operation.", "The former president will direct immigration officers to deny entry to \"Marxists\" and \"communists.\"", "The policies aim to disqualify most migrants from asylum.", "The policies include the \"remain in Mexico\" policy.", "The policies include the \"safe third country\" policy.", "Immigration and Customs Enforcement is a government agency.", "Immigration and Customs Enforcement has around 8,000 employees.", "Immigration and Customs Enforcement has vowed to carry out the largest deportation operation in U.S. history.", "U.S. law affords immigrants in deportation proceedings due process.", "Stephen Yale-Loehr states that U.S. law provides due process for immigrants in deportation proceedings."], "Border crossings and immigration: How Biden and Trump compare - CSMonitor.com": ["Immigration is a top issue.", "The Migration Policy Institute released a report.", "The report states that there has been a rapid increase in arrivals in recent years.", "The increase in arrivals reflects instability in other parts of the world.", "Immigration is ranked as the No. 1 national concern for voters.", "Several major polls have ranked immigration as the top concern for voters.", "The increase in arrivals reflects crises in the Americas.", "These actions have incentivized illegal immigration.", "These actions have undermined border security.", "There have been 6.4 million encounters at the US-Mexico border in the past 12 months.", "These encounters occurred outside official ports of entry.", "CBP agents have registered more than 1.6 million encounters.", "The encounters took place at official ports of entry in the United States.", "Border Patrol tracks migrants crossing the border.", "Migrants were seen crossing by border agents.", "Nearly 400,000 migrants were tracked by Border Patrol in the most recent fiscal year reported, 2021.", "The pandemic has caused an increase in attempted migration to the US.", "Migrants are arriving at ports of entry.", "Migrants are often participating in humanitarian parole programs.", "A federal judge upheld a humanitarian parole program in March.", "The number of unauthorized immigrants in the U.S. rose by 2.4 million.", "The rise in unauthorized immigration was a key factor in the U.S. economy's strong growth in 2021.", "The Migration Policy Institute estimates the 2021 unauthorized immigrant population at 11.2 million.", "The number of unauthorized immigrants in the United States has been steadily declining since 2007.", "Under the Trump administration, migrants were deemed ineligible for asylum.", "Asylum-seekers can now make an appointment at a U.S. port of entry to seek asylum.", "The number of people granted asylum per year dipped during Mr. Biden's first year in office.", "The Immigration and Nationality Act was passed.", "The Act allowed temporary entry to noncitizens.", "The provision was used to welcome immigrants en masse.", "301,000 migrants were paroled at official ports of entry in fiscal 20.", "Parole has traditionally occurred at official ports of entry.", "Official ports of entry include airports.", "The Biden administration has made a significant shift in allowing migrants to enter the United States.", "The purpose of allowing migrants to enter is to seek asylum.", "Border Patrol agents have the authority to expel migrants on public health grounds.", "Migrants can try to cross the border again without penalty.", "The number of border crossings has increased fourfold due to this policy."], "extraction_info": {"Average claims per article": 16.77777777777778, "Maximum": 38, "Minimum": 2, "Variance": 8.866638819226667, "Detail": [6, 26, 15, 23, 22, 24, 17, 14, 22, 2, 23, 6, 23, 12, 11, 6, 12, 38], "Average paragraph length per article": 1535.0, "Detailed length": [939, 1434, 1145, 1416, 1525, 2529, 2375, 1436, 1120, 1421, 1360, 1952, 1576, 1312, 1795, 646, 1229, 2420]}}